.DEFAULT_GOAL := build

# Makefileでは記述対象の「操作」のことを「ターゲット」と呼ぶ。
# .DEFAULT_GOALはデフォルトのターゲットを定義する。
# 上記では、「build」がデフォルトのターゲット(操作)になる。



# 「:」の前にある文字列がターゲット(操作)の名前を表す。
fmt:
# ターゲット(操作)によって実行されるタスクはインデントされた行に書かれる
	go fmt
# 「.PHONY」は読み手の為のもの（無くても良い）。意味は「fmt」と名前が付けられた『タスク』を実行するためのターゲット(操作)であることを示す。
.PHONY: fmt

# ターゲットの後ろに書いてある文字列(例えば「lint: fmt」の行のfmt)は
# そのターゲットの "前提" となる(一段階前の)ターゲット(操作)である。
lint: fmt
	staticcheck
.PHONY: lint

vet: fmt
	go vet
.PHONY: vet

build: vet
	go mod tidy
	go build
.PHONY: build



# 「make」で実行する
# 実行順は
# 1「go fmt」 　　  コードを正しくフォーマットする
# 2「staticcheck」  コードのスタイルがガイドラインに沿っているかチェックする
# 3「go vet」　　　 明白でないエラーを見つける　
# 4「go modtidy」　 ソースファイルを解析して必要なものを(サードパーティライブラリ)DL、不要なものを削除する。
# 5「go build」

# 注意点は、ターゲット(操作)を『make』する際に実際に実行するステップ(コマンドなど)は必ず"タブを使用して字下(インデント)"する必要がある。